package com.抽象类;
/**
 *  1、什么是抽象类？
 *      对象是现实世界中存在的，类是现实世界中不存在的，类是人类大脑思考总结的结果；对象抽象成一类，两大类进行再一次的抽象成为另外一个大类；
 *      抽象类无法实例化对象，无法创建对象因为他是类的类，所以不可以
 *
 *  2、抽象类属于什么类型？
 *      抽象类属于引用数据类型
 *  3、抽象类的定义是什么？
 *  【修饰符列表】 abstract class 类名{
 *
 *  }
 *
 *  4、抽象类是无法进行实例化的，无法创建对象，抽象类是用来被字类继承的
 *
 *  5、 final 和 abstract 是对立的，不能进行联合的使用；
 *
 *  6、抽象类的字类可以是抽象类
 *
 *  7、抽象类不能实例化，但是可以有构造方法，构造方法提供给字类使用；
 *
 *  8、抽象类关联到抽象方法：什么是抽象方法呢？
 *      抽象方法表示没有实现的方法，
 *          public abstract void doSome();
 *          抽象方法的特点：
 *              1. 没有方法体，使用封号进行结尾
 *              2. 前面使用 abstract 进行修饰
 *
 *              3. 抽象方法一定是抽象类，抽象类中不一定有抽象方法；
 */
public class AbstractTest01 {
    public static void main(String[] args) {

    }
}
