package com.day07;
/*
    面向对象的的三大特征
        - 封装  - com.继承  - 多态
        javascript 叫做基于对象


    面向对象进行软件的开发 主要有：分析OOA 设计OOD 编程OOP
    Objects Oriented Analyst（oriented 面向什么方向的意思）
    Design 面向对象的分析

    * 什么是类？


    * 什么是对象？

    * Java软件工程师的作用
    中间的桥梁转换作用 现实与虚拟之间的转换

    类提取共同的特征
    一个模板当作是一个类
    类的示例化叫做类

    对象是个性的东西
    类是一群对象的抽象集合 个别的特征与抽象的集体的特征
    共同特征是一个模板 对象是模板的扩展或者复制 具有个体的东西

    对象叫做实例 对象到类叫做抽象
    实例到对象叫做示例化 实例（instance）

    重点
    类描述的是共同特征 当特征进行访问的时候 需要进行先创建对象因为不同的对象的特征是不同的
    一个类主要是 状态 + 动作 名字叫做一种状态 姓名也是一种状态 身高也是一种状态 两个对象具有共同的特征
    动作信息：唱歌 跳舞


       过程 关注因果关系
       对象 关注对象的功能

       抽象 示例化 instance 属性（描述状态，年龄，属性，出生的日期）以及方法（相关的动作）

       状态和动作发生到不同的对象结果发生可能会不一样
 */
public class 面向对象基本语法2 {
    public static void main(String[] args){

    }
}
