package com.day07;
/*
    1   什么是类 什么是对象
    2   面向过程以及面向对象的区别

    什么是面向过程？
    1   因果关系
    2   由整个因为所以 实现的一个过程叫做面向过程的编程 注重 因果关系的概念 没有对象独立的概念
    3   面向过程，只要有一个环节出错了，那么软件就可能崩掉了，关注的是过程
    4   面向对象，不关注过程，不关注对象的底层是什么，我需要知道你这个对象可以干什么

    5   一个面向过程，需要知道代码之间的逻辑，面向对象，需要知道对象的功能
        独立的个体进行组合完成某一个动作，完成一个场景
        面向对象，有着独立的个体

        现实世界的不同分割，进行协作运行

        关联程度 低耦合 多扩展 各种各样的对象 之间的关系

        * 面向过程 主要关注的点是具体的过程 因果关系
            * 优点 适合简单的开发逻辑
            * 缺点 难以解决难的开发逻辑 软件元素的耦合度比较高 使得扩展性能比较差 无法达到组件的重复使用

        * 面向对象 主要关注对象 独立题完成的功能
            * 优点 耦合度比较低 可以进行后期的扩展
            * 缺点 前期的投入的成本比阿高
            * c 语言是面向过程的  C++ 是半面向过程的 Java 是面向对象的

 */
public class 面向对象基本语法1 {
    public static void main(String[] args){


    }
}
